ut-dragon-lab/aerial_robot_nerve/spinal/mcu_project/boards/stm32H7_v2/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "lwip.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <cstring>
#include <string>

/* #include <ros.h> */
#include <microros_transport_stm32.h>
#include <rcl/rcl.h>
#include <rclc/rclc.h>
#include <rclc/executor.h>
#include <rmw_microros/rmw_microros.h>
#include <ros_utils/ros_module_base.hpp>
#include <ros_utils/ros_module_manager.hpp>
#include <ros_utils/ros_context.hpp>

#include <std_msgs/msg/u_int32.h>
#include <std_msgs/msg/u_int8.h>
/* #include <std_msgs/String.h> */
/* #include <std_msgs/Empty.h> */
/* #include <spinal/ServoControlCmd.h> */
#include <spinal_msgs/msg/imu.h>

#include "flashmemory/flashmemory.h"
#include "sensors/imu/drivers/mpu9250/imu_mpu9250.h"
#include "sensors/imu/drivers/icm20948/icm_20948.h"
#include "sensors/imu/imu_ros_module.h"
#include "sensors/baro/baro_ros_module.h"
#include "sensors/gps/gps_ublox.h"
#include "sensors/gps/gps_ros_module.h"
#include "sensors/encoder/mag_encoder_ros_module.h"

#include "battery_status/battery_status_ros_module.h"
#include "servo/servo_ros_module.h"
#include "thruster/board/thruster_ros_module.h"
#include "flight_control/board/flight_control_ros_module.h"

#include "state_estimate/state_estimate_ros_module.h"

/* #include <Spine/spine.h> */

/* #include "dshot_esc/dshot.h" */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define MICROROS_INIT_PING_TIMEOUT_MS      100
#define MICROROS_INIT_PING_ATTEMPTS        1
#define MICROROS_MONITOR_PING_INTERVAL_MS  500
#define MICROROS_MONITOR_PING_TIMEOUT_MS   20
#define MICROROS_MONITOR_PING_ATTEMPTS     1
#define MICROROS_MONITOR_SESSION_TIMEOUT_MS 20
#define MICROROS_MONITOR_SESSION_FAIL_LIMIT 2
#define MICROROS_ENTITY_CREATION_TIMEOUT_MS 100
#define MICROROS_ENTITY_DESTROY_TIMEOUT_MS 20
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

FDCAN_HandleTypeDef hfdcan1;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim4;
DMA_HandleTypeDef hdma_tim1_ch1;
DMA_HandleTypeDef hdma_tim1_ch2;
DMA_HandleTypeDef hdma_tim1_ch3;
DMA_HandleTypeDef hdma_tim1_ch4;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
UART_HandleTypeDef huart6;
DMA_HandleTypeDef hdma_usart1_rx;
DMA_HandleTypeDef hdma_usart1_tx;
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart3_rx;
DMA_HandleTypeDef hdma_usart6_rx;

osThreadId coreTaskHandle;
osThreadId rosSpinTaskHandle;
osThreadId idleTaskHandle;
osThreadId imuPublishTaskHandle;
osThreadId voltageHandle;
osThreadId canRxHandle;
osThreadId servoTaskHandle;
osTimerId coreTaskTimerHandle;
osMutexId rosPubMutexHandle;
osMutexId flightControlMutexHandle;
osSemaphoreId coreTaskSemHandle;
osSemaphoreId uartTxSemHandle;
/* USER CODE BEGIN PV */
osMailQId canMsgMailHandle;

/* micro ros */
static RosContext ros_cxt_;
static RosModuleManager<8> ros_mgr_;

/* /\* sensor instances *\/ */
ImuRosModule imu_ros_mod_;
#if IMU_MPU
IMUOnboard imu_;
#elif IMU_ICM
ICM20948 imu_;
#endif

BaroRosModule baro_ros_mod_;
GpsRosModule gps_ros_mod_;
BatteryStatusRosModule battery_status_ros_mod_;
ThrusterRosModule thruster_ros_mod_;
FlightControlRosModule flight_control_ros_mod_;

/* servo instance */
DirectServoRosModule servo_ros_mod_;
/* DShot dshot_; */


StateEstimateRosModule estimator_ros_mod_;
/* FlightControl controller_; */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_FDCAN1_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC1_Init(void);
static void MX_I2C3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM4_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_USART2_UART_Init(void);
void coreTaskFunc(void const * argument);
void rosSpinTaskFunc(void const * argument);
void idleTaskFunc(void const * argument);
void imuPublishTaskFunc(void const * argument);
void voltageTask(void const * argument);
void canRxTask(void const * argument);
void ServoTaskCallback(void const * argument);
void coreTaskEvokeCb(void const * argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static bool ensure_ros_mutex_created()
{
  if (ros_cxt_.ros_mutex != nullptr) return true;

#if (osCMSIS < 0x20000U)
  osMutexDef(rosMutex);
  ros_cxt_.ros_mutex = osMutexCreate(osMutex(rosMutex));
#else
  static const osMutexAttr_t attr = { .name = "rosMutex" };
  ros_cxt_.ros_mutex = osMutexNew(&attr);
#endif

  if (ros_cxt_.ros_mutex == nullptr) {
    Error_Handler();
  }
  return true;
}

static void microros_configure_context_timeouts(void)
{
  rmw_context_t* rmw_context = rcl_context_get_rmw_context(&ros_cxt_.support.context);
  if (rmw_context == nullptr) {
    return;
  }

  (void)rmw_uros_set_context_entity_creation_session_timeout(
    rmw_context,
    MICROROS_ENTITY_CREATION_TIMEOUT_MS);
  (void)rmw_uros_set_context_entity_destroy_session_timeout(
    rmw_context,
    MICROROS_ENTITY_DESTROY_TIMEOUT_MS);
}

static void microros_init_all(void)
{
  // 0) Create muxte for ros
  ensure_ros_mutex_created();

  ros_cxt_.ready.store(false, std::memory_order_release);
  ros_cxt_.support = rclc_support_t{};
  ros_cxt_.node = rcl_get_zero_initialized_node();
  ros_cxt_.executor = rclc_executor_get_zero_initialized_executor();

  // 1) Register custom transport (must be done before rclc_support_init)
  microros_transport_init();
  
  while (rmw_uros_ping_agent(MICROROS_INIT_PING_TIMEOUT_MS,
                             MICROROS_INIT_PING_ATTEMPTS) != RMW_RET_OK)
    {
      osDelay(100);
    }

  // 2) Init rcl/rclc
  ros_cxt_.allocator = rcl_get_default_allocator();
  rclc_support_init(&ros_cxt_.support, 0, NULL, &ros_cxt_.allocator);
  microros_configure_context_timeouts();

