ut-dragon-lab/aerial_robot_nerve/spinal/mcu_project/boards/stm32H7_v2/Src/main.c
  rclc_node_init_default(&ros_cxt_.node, "stm32_node", "", &ros_cxt_.support);

  ros_mgr_.set_ros_mutex_all(&ros_cxt_.ros_mutex);
  ros_mgr_.set_ros_ready_all(&ros_cxt_.ready);

  // 3) Create pub & sub of all ros modules
  osMutexWait(ros_cxt_.ros_mutex, osWaitForever);
  ros_mgr_.create_all(ros_cxt_.node);

  // 4) Count number of handles
  const size_t N = ros_mgr_.total_executor_handles();
  rclc_executor_init(&ros_cxt_.executor, &ros_cxt_.support.context, N, &ros_cxt_.allocator);

  // 5) Register to executor
  ros_mgr_.add_all(ros_cxt_.executor);

  ros_cxt_.ready.store(true, std::memory_order_release);
  osMutexRelease(ros_cxt_.ros_mutex);
}

static void microros_fini_all(void)
{
  osMutexWait(ros_cxt_.ros_mutex, osWaitForever);
  ros_cxt_.ready.store(false, std::memory_order_release);

  // executor -> module destroy -> node/support
  (void)rclc_executor_fini(&ros_cxt_.executor);
  ros_mgr_.destroy_all(ros_cxt_.node);

  (void)rcl_node_fini(&ros_cxt_.node);
  (void)rclc_support_fini(&ros_cxt_.support);

  ros_cxt_.executor = rclc_executor_get_zero_initialized_executor();
  ros_cxt_.node = rcl_get_zero_initialized_node();
  ros_cxt_.support = rclc_support_t{};

  osMutexRelease(ros_cxt_.ros_mutex);
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_FDCAN1_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_ADC1_Init();
  MX_I2C3_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  MX_TIM1_Init();
  MX_TIM4_Init();
  MX_USART6_UART_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */

  // workaround for the wired generation of STMCubeMX
  HAL_NVIC_DisableIRQ(DMA1_Stream0_IRQn); // we do not need DMA Interrupt for USART1 RX, circular mode
  HAL_NVIC_DisableIRQ(DMA1_Stream2_IRQn); // we do not need DMA Interrupt for USART3 RX, circular mode

  /* Flash Memory */
  FlashMemory::init(0x081E0000, FLASH_SECTOR_7);
  // Bank2, Sector7: 0x081E 0000 (128KB); https://www.stmcu.jp/download/?dlid=51599_jp
  // BANK1 (with Sector7) cuases the flash failure by STLink from the second time. So we use BANK_2, which is tested OK

  // It semms like the first 64 byte of flashmemory for data is easily to be overwritten by zero, when re-flash the flash memory.
  // A possible reason is the power supply from stlink does not contain 3.3V output.
  // which is the only difference compared with the old version (STM32F7)
  // So, we introduce following dummy data for a workaround to avoid the vanishment of stored data in flash memory.
  uint8_t dummy_data[64];
  memset(dummy_data, 1, 64);
  FlashMemory::addValue(dummy_data, 64);

#if 0 // test flash memory

  uint8_t test_data[128];
  for(int i = 0; i < 128; i++)
    test_data[i] = i;
  FlashMemory::addValue(test_data, 128);

  int32_t test_int = -1234;
  //int32_t test_int;
  FlashMemory::addValue(&test_int, sizeof(test_int));

  float test_float = 1.1f;
  //float test_float;
  FlashMemory::addValue(&test_float, sizeof(test_float));

  /* FlashMemory::erase(); */
  /* FlashMemory::write(); */
  FlashMemory::read();
#endif

  ensure_ros_mutex_created();
  
  imu_.init(&hspi1, &hi2c3, IMUCS_GPIO_Port, IMUCS_Pin, LED0_GPIO_Port, LED0_Pin);
  imu_ros_mod_.addImu(&imu_);
  ros_mgr_.add(&imu_ros_mod_);
  
  baro_ros_mod_.init_hw(&hi2c1, BAROCS_GPIO_Port, BAROCS_Pin);
  ros_mgr_.add(&baro_ros_mod_);

  gps_ros_mod_.init_hw(&huart3, LED2_GPIO_Port, LED2_Pin);
  ros_mgr_.add(&gps_ros_mod_);

  estimator_ros_mod_.init_hw(&imu_, baro_ros_mod_.getBaroHw(), gps_ros_mod_.getGpsHw());  // imu + baro + gps => att + alt + pos(xy)
  ros_mgr_.add(&estimator_ros_mod_);

/*   DShot* dshotptr = nullptr; */
#if DSHOT
  battery_status_ros_mod_.init_hw(&hadc1, false);
#else
  battery_status_ros_mod_.init_hw(&hadc1);
#endif
  ros_mgr_.add(&battery_status_ros_mod_);

  thruster_ros_mod_.init_hw(&htim1, &htim4);
#if DSHOT
  thruster_ros_mod_.init_dshot_telemetry(&huart6);
#endif
  thruster_ros_mod_.setBatteryStatus(battery_status_ros_mod_.getBatteryCore());
  ros_mgr_.add(&thruster_ros_mod_);

/* #if DSHOT */
  /* estimator_.init(&imu_, &baro_, &gps_, &node, &executor);  // imu + baro + gps => att + alt + pos(xy) */
/*   dshot_.init(DSHOT600, &htim1,TIM_CHANNEL_1, &htim1,TIM_CHANNEL_2, &htim1,TIM_CHANNEL_3, &htim1, TIM_CHANNEL_4); */
/*   dshot_.initTelemetry(&huart6); */
/*   dshotptr = &dshot_; */
/* #else */
/*   estimator_.init(&imu_, &baro_, &gps_, &nh_);  // imu + baro + gps => att + alt + pos(xy) */
/* #endif */

  FlashMemory::read(); // battery scale and IMU calib data (including IMU in neurons)

  const bool servo_connect = servo_ros_mod_.init_hw(&huart2, nullptr);
  if (servo_connect) {
    ros_mgr_.add(&servo_ros_mod_);
  }

  flight_control_ros_mod_.init_hw(
    estimator_ros_mod_.getStateEstimateCore(),
    thruster_ros_mod_.getThrusterManager(),
    servo_connect ? servo_ros_mod_.getServoCore() : nullptr,
    &flightControlMutexHandle);
  ros_mgr_.add(&flight_control_ros_mod_);

/*   bool nerve_connect = Spine::init(&hfdcan1, &nh_, &estimator_, &controller_, LED1_GPIO_Port, LED1_Pin); */

/*   if(nerve_connect) Spine::useRTOS(&canMsgMailHandle); // use RTOS for CAN in spianl */

  /* USER CODE END 2 */

  /* Create the mutex(es) */
  /* definition and creation of rosPubMutex */
  osMutexDef(rosPubMutex);
  rosPubMutexHandle = osMutexCreate(osMutex(rosPubMutex));

  /* definition and creation of flightControlMutex */
  osMutexDef(flightControlMutex);
  flightControlMutexHandle = osMutexCreate(osMutex(flightControlMutex));

