ut-dragon-lab/aerial_robot_nerve/spinal/mcu_project/boards/stm32H7_v2/Src/main.c
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_coreTaskFunc */
/**
  * @brief  Function implementing the coreTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_coreTaskFunc */
void coreTaskFunc(void const * argument)
{
  /* USER CODE BEGIN 5 */
  /* start timers */
  osTimerStart(coreTaskTimerHandle, 1); // 1 ms (1kHz)
#ifdef USE_ETH
  /* init code for LWIP */
  MX_LWIP_Init();
#endif

  /* it is better to init this Node before register publisher/subscriber
     since we have to use LWIP/Ethernet after start RTOS,
     we have to first do registration before following initNode.
     Or, we can move the senser init funcs to following scope,
     which contains the HAL_Delay that effecting the RTOS tick.
     TODO: please try.
  */

  /* ros node hardware init */
#ifndef USE_ETH
  /* nh_.initNode(&huart1, &rosPubMutexHandle, &uartTxSemHandle); */
  //nh_.initNode(&huart1, &rosPubMutexHandle, NULL); // no DMA for TX
#else

  ip4_addr_t dst_addr;
  IP4_ADDR(&dst_addr,192,168,25,100);
  /* nh_.initNode(dst_addr, 12345,12345); */
#endif

  imu_.gyroCalib(true, IMU::GYRO_DEFAULT_CALIB_DURATION); // re-calibrate gyroscope because of the HAL_Delay in spine init

  osSemaphoreWait(coreTaskSemHandle, osWaitForever);

  for(;;)
    {
      if(!ensure_ros_mutex_created()) return;
      osSemaphoreWait(coreTaskSemHandle, osWaitForever);

      /* Spine::send(); */
      imu_.update();
      baro_ros_mod_.update();
      gps_ros_mod_.update();
      estimator_ros_mod_.update();
      flight_control_ros_mod_.update();
      thruster_ros_mod_.sendCommand();

      /* Spine::update(); */

      // Workaround to handle the BUSY->TIMEOUT Error problem of ETH handler in STM32H7
      // We observe this is occasionally occur, but the ETH DMA is valid.
      if (heth.ErrorCode & HAL_ETH_ERROR_TIMEOUT)
        {
          // force to restart ETH transmit
          heth.gState = HAL_ETH_STATE_READY;
          ETH_TxDescListTypeDef *dmatxdesclist = &(heth.TxDescList);
          for (uint32_t i = 0; i < (uint32_t)ETH_TX_DESC_CNT; i++)
            {
              ETH_DMADescTypeDef *dmatxdesc = (ETH_DMADescTypeDef *)dmatxdesclist->TxDesc[i];
              CLEAR_BIT(dmatxdesc->DESC3, ETH_DMATXNDESCRF_OWN);
            }
        }
      osDelay(1);
    }

  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_rosSpinTaskFunc */
/**
* @brief Function implementing the rosSpinTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_rosSpinTaskFunc */
void rosSpinTaskFunc(void const * argument)
{
  /* USER CODE BEGIN rosSpinTaskFunc */
  (void)argument;

  uint32_t last_ping = HAL_GetTick();
  uint8_t session_fail_count = 0;

  microros_init_all();

  for (;;)
    {
      uint32_t now = HAL_GetTick();

      if ((now - last_ping) >= MICROROS_MONITOR_PING_INTERVAL_MS)
        {
          osMutexWait(ros_cxt_.ros_mutex, osWaitForever);
          rmw_ret_t ping_ret = rmw_uros_ping_agent(MICROROS_MONITOR_PING_TIMEOUT_MS,
                                                   MICROROS_MONITOR_PING_ATTEMPTS);
          rmw_ret_t session_ret = RMW_RET_OK;
          if (ping_ret == RMW_RET_OK)
            {
              session_ret = rmw_uros_sync_session(MICROROS_MONITOR_SESSION_TIMEOUT_MS);
            }
          osMutexRelease(ros_cxt_.ros_mutex);

          if (ping_ret != RMW_RET_OK)
            {
              session_fail_count = 0;
              microros_fini_all();
              microros_init_all();
              last_ping = HAL_GetTick();
              continue;
            }

          if (session_ret != RMW_RET_OK)
            {
              session_fail_count++;
              if (session_fail_count >= MICROROS_MONITOR_SESSION_FAIL_LIMIT)
                {
                  session_fail_count = 0;
                  microros_fini_all();
                  microros_init_all();
                  last_ping = HAL_GetTick();
                  continue;
                }
            }
          else
            {
              session_fail_count = 0;
            }
          last_ping = now;
        }

      if(ros_cxt_.ready.load())
        {
          osMutexWait(ros_cxt_.ros_mutex, osWaitForever);
          rclc_executor_spin_some(&ros_cxt_.executor, RCL_MS_TO_NS(0));
          gps_ros_mod_.publish();
          servo_ros_mod_.publish();
          thruster_ros_mod_.publish();
          flight_control_ros_mod_.publish();
          osMutexRelease(ros_cxt_.ros_mutex);
          osThreadYield();
        }
      else
        {
          osDelay(1);
        }
      /* osDelay(1); */
    }
  /* USER CODE END rosSpinTaskFunc */
}

/* USER CODE BEGIN Header_idleTaskFunc */
/**
* @brief Function implementing the idleTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_idleTaskFunc */
void idleTaskFunc(void const * argument)
{
  /* USER CODE BEGIN idleTaskFunc */
  for(;;)
  {
    // HAL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin);
    osDelay(1000);
  }
  /* USER CODE END idleTaskFunc */
}

/* USER CODE BEGIN Header_imuPublishTaskFunc */
/**
* @brief Function implementing the imuPublishTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_imuPublishTaskFunc */
void imuPublishTaskFunc(void const * argument)
{
  /* USER CODE BEGIN imuPublishTaskFunc */
  (void)argument;

  for(;;)
    {
      if(ros_cxt_.ready.load())
        {
          const uint32_t next_publish_delay_ms = estimator_ros_mod_.millisToNextPublish();
          if (next_publish_delay_ms > 0)
            {
              osDelay(next_publish_delay_ms);
              continue;
            }

          osMutexWait(ros_cxt_.ros_mutex, osWaitForever);
          estimator_ros_mod_.publish();
          osMutexRelease(ros_cxt_.ros_mutex);
          osThreadYield();
        }
      else
        {
          osDelay(1);
        }

